Tekla Open API Reference for Tekla Structures 2025
DimensionSetBase.AddToDimensionSet Method
 Adds a dimension set to the current dimension set.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddToDimensionSet(
	DimensionSetBase SetToAdd
)
Public Function AddToDimensionSet (
	SetToAdd As DimensionSetBase
) As Boolean
Parameters
SetToAdd
Type: Tekla.Structures.Drawing.DimensionSetBase
The dimension set to be added.
Return Value
Type: Boolean
True on success.
See Also
Reference
DimensionSetBase Class
Tekla.Structures.Drawing Namespace